<pre>
hakell里的一等公民是 {函数} 调用参数时一定要参数完整性。
模式的顺序是如此重要：它总是优先匹配最符合的那个，最后才是那个万能的。
x:xs这模式的应用非常广泛，尤其是递归函数。不过它只能匹配长度大于等于1的list。
如果你要把list的前三个元素都绑定到变量中，可以使用类似x:y:z:xs这样的形式。它只能匹配长度大于等于3的list。
let绑定本身是个表达式，而where绑定则是个语法结构。
缩进用空格。。。
要拒绝循环与状态的改变而通过定义问题"是什么"来解决问题，高阶函数必不可少。它们是编码的得力工具。
本质上，haskell的所有函数都只有一个参数， 所有多个参数的函数都是柯里函数。
max :: (Ord a) => a -> (a -> a)。 
可以读作max取一个参数a，并返回一个函数(就是那个->)，这个函数取一个a类型的参数，返回一个a。 
这便是为何只用箭头来分隔参数和返回值类型。
简言之，我们若以不全的参数来调用某函数，就可以得到一个不全调用的函数。 
如果你高兴，构造新函数就可以如此便捷，将其传给另一个函数也是同样方便。
中缀函数也可以不全调用，用括号把它和一边的参数括在一起就行了。 这返回一个取一参数并将其补到缺少的那一端的函数。
</pre>
